//
//  ListExercise.swift
//  iGym
//
//  Created by Сергей Юханов on 16/04/2019.
//  Copyright © 2019 Юханов Сергей Сергеевич. All rights reserved.
//

import Foundation

struct ListExercise {
    //to make array
    static var exerciseArray: [String] = ["Жим лежа", "Армейский жим", "Становая тяга", "Присед", "Отведение гантелей назад в наклоне"]
    static var group: [String] = ["Грудь", "Плечи", "Спина", "Бицепс", "Трицепс", "Ноги"]
    static var shouldersArray: [String] = ["Тяга штанги к подбородку", "Армейский жим", "Жим Арнольда", "Отведение гантелей назад в наклоне", "Подъем гантелей на передний пучок", "Подъем гантелей на средний пучок"]
    static var backArray: [String] = ["Становая тяга", "Тяга штанги в наклоне", "Тяга гантелей к пояснице", "Тяга верхнего блока", "Гиперэкстензия"]
    static var bicepsArray: [String] = ["Подъем штанги на бицепс", "Подъем гантелей сидя", "Тяга блока снизу", "Жим в скамье Скота"]
    static var tricepsArray: [String] = ["Французский жим", "Жим лежа узким хватом", "Разведение рук на веревках", "Опускание гантели за голову сидя"]
    static var legsArray: [String] = ["Присед", "Разведение ног в тренажере", "Сведение ног в тренажере", "Жим блока ногами"]
    static var collectionList: [String] = []
}
